In [4]:
people = {
    'first': ['ali', 'sani', 'amir'],
    'second': ['test1','test2','test2'],
    'email': ['t1@gmail.com','t2@gmail.com','t3@gmail.com']
}

In [5]:
import pandas as pd

In [6]:
df = pd.DataFrame(people)

In [8]:
df

  first second         email
0   ali  test1  t1@gmail.com
1  sani  test2  t2@gmail.com
2  amir  test2  t3@gmail.com

# How filter data from a data frame

In [9]:
df['second'] == 'test2'

0    False
1     True
2     True
Name: second, dtype: bool

In [10]:
filt = (df['second'] == 'test2')

In [11]:
df[filt]

  first second         email
1  sani  test2  t2@gmail.com
2  amir  test2  t3@gmail.com

In [12]:
df[df['second'] == 'test2']

  first second         email
1  sani  test2  t2@gmail.com
2  amir  test2  t3@gmail.com

In [13]:
df.loc[filt]

  first second         email
1  sani  test2  t2@gmail.com
2  amir  test2  t3@gmail.com

In [14]:
df.loc[filt, 'email']

1    t2@gmail.com
2    t3@gmail.com
Name: email, dtype: object

In [16]:
filt2 = (df['second'] == 'test2') & (df['first'] == 'sani')

In [18]:
df.loc[filt2, ['first', 'second']]

  first second
1  sani  test2

In [19]:
filt3 = (df['second'] == 'test1') | (df['first'] == 'sani')

In [20]:
df.loc[filt3, ['email']]

          email
0  t1@gmail.com
1  t2@gmail.com

# Negate a filter

In [21]:
df.loc[-filt3, ['email']]

          email
2  t3@gmail.com